devdnl/dnx-rtos/src/system/drivers/i2c/stm32f4/i2c_lld.c
        return wait_for_I2C_event(hdl, I2C_SR1_SB);
}

//==============================================================================
/**
 * @brief  Function generate REPEAT START sequence on I2C bus
 * @param  hdl                  device handle
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__repeat_start(I2C_dev_t *hdl)
{
        I2C_TypeDef *i2c = get_I2C(hdl);

        CLEAR_BIT(i2c->CR1, I2C_CR1_STOP);
        SET_BIT(i2c->CR1, I2C_CR1_START | I2C_CR1_ACK);

        u32_t tref = sys_time_get_reference();

        while (!(i2c->SR1 & I2C_SR1_SB)) {
                if (sys_time_is_expired(tref, _I2C_DEVICE_TIMEOUT)) {
                        return EIO;
                }

                if (i2c->SR1 & (I2C_SR1_ARLO | I2C_SR1_BERR)) {
                        return EIO;
                }
        }

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Function generate STOP sequence on I2C bus
 * @param  hdl                  device handle
 */
//==============================================================================
void _I2C_LLD__stop(I2C_dev_t *hdl)
{
        I2C_TypeDef *i2c = get_I2C(hdl);

        SET_BIT(i2c->CR1, I2C_CR1_STOP);
}

//==============================================================================
/**
 * @brief  Function send I2C address sequence
 * @param  hdl                  device handle
 * @param  write                true: compose write address
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__send_address(I2C_dev_t *hdl, bool write)
{
        int err = EIO;

        I2C_TypeDef *i2c = get_I2C(hdl);

        if (hdl->config.addr_10bit) {
                u8_t hdr = _I2C_HEADER_ADDR_10BIT | ((hdl->config.address >> 7) & 0x6);

                // send header + 2 most significant bits of 10-bit address
                i2c->DR = _I2C_HEADER_ADDR_10BIT | ((hdl->config.address & 0xFE) >> 7);
                err = wait_for_I2C_event(hdl, I2C_SR1_ADD10);
                if (err) goto finish;

                // send rest 8 bits of 10-bit address
                u8_t  addr = hdl->config.address & 0xFF;
                u16_t tmp  = i2c->SR1;
                (void)tmp;   i2c->DR = addr;
                err = wait_for_I2C_event(hdl, I2C_SR1_ADDR);
                if (err) goto finish;

                clear_send_address_event(hdl);

                // send repeat start
                err = _I2C_LLD__start(hdl);
                if (err) goto finish;

                // send header
                i2c->DR = write ? hdr : hdr | 0x01;
                err = wait_for_I2C_event(hdl, I2C_SR1_ADDR);

        } else {
                u16_t tmp = i2c->SR1;
                      tmp = i2c->SR2;
                (void)tmp;
                i2c->DR = write ? (hdl->config.address & 0xFE) : (hdl->config.address | 0x01);
                err = wait_for_I2C_event(hdl, I2C_SR1_ADDR);
        }

        finish:
        if (!err) {
                clear_send_address_event(hdl);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Function receive bytes from I2C bus (master-receiver)
 * @param  hdl                  device handle
 * @param  dst                  destination buffer
 * @param  count                number of bytes to receive
 * @param  rdcnt                number of read bytes
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__receive(I2C_dev_t *hdl, u8_t *dst, size_t count, size_t *rdcnt)
{
        int          err = EIO;
        ssize_t      n   = 0;
        I2C_TypeDef *i2c = get_I2C(hdl);

        if (count == 2) {
                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                SET_BIT(i2c->CR1, I2C_CR1_POS);
        } else {
                CLEAR_BIT(i2c->CR1, I2C_CR1_POS);
                SET_BIT(i2c->CR1, I2C_CR1_ACK);
        }

        if (count >= 3) {
                clear_send_address_event(hdl);

#if USE_DMA > 0
                if (I2C_HW[hdl->major].use_DMA) {
                        u32_t dmad = _DMA_DDI_reserve(0, I2C_HW[hdl->major].DMA_rx_stream_pri);
                        if (dmad == 0) {
                                dmad = _DMA_DDI_reserve(0, I2C_HW[hdl->major].DMA_rx_stream_alt);
                        }

                        if (dmad) {
                                CLEAR_BIT(i2c->CR2, I2C_CR2_ITBUFEN | I2C_CR2_ITERREN | I2C_CR2_ITEVTEN);

                                _DMA_DDI_config_t config;
                                config.arg      = _I2C[hdl->major];
                                config.callback = DMA_callback;
                                config.release  = true;
                                config.PA       = cast(u32_t, &i2c->DR);
                                config.MA[0]    = cast(u32_t, dst);
                                config.NDT      = count;
                                config.CR       = ((I2C_HW[hdl->major].DMA_channel & 7) << DMA_SxCR_CHSEL_Pos)
                                                | DMA_SxCR_MINC | DMA_SxCR_TCIE | DMA_SxCR_TEIE;

                                if (_DMA_DDI_transfer(dmad, &config) == ESUCC) {
                                        err = wait_for_DMA_event(hdl);
                                        if (!err) {
                                                n = count;
                                                goto finish;
                                        }
                                }

                                _DMA_DDI_release(dmad);
                        }
                }
#endif
                {
                        while (count) {
                                if (count == 3) {
                                        err = wait_for_I2C_event(hdl, I2C_SR1_BTF);
                                        if (err) break;

                                        CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                                        *dst++ = i2c->DR;
                                        n++;

